Revit 2024 API
BRepBuilder.GetResult Method
Overload List
Name | Description
GetResult()
 Get the Geometry object built by this BRepBuilder. This will clear the built Geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
GetResult(ExternalGeometryId, BRepBuilderPersistentIds)
 Get the Geometry object built by this BRepBuilder. This will clear the built Geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
See Also
BRepBuilder Class
BRepBuilder Members
Autodesk.Revit.DB Namespace